Revit 2024 API
BuiltInFailures.PerformanceFailures.TooManyElementsInSketch Property
 Sketch of <element> contains too many objects - it may take long time to solve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TooManyElementsInSketch { get; }
Visual Basic
Public Shared ReadOnly Property TooManyElementsInSketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TooManyElementsInSketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace